In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame({'Age': [15.0, np.nan, 18.0, 19.4, 20.0, 15.0, 15.0, 15.0, 20.0],
    'Gender': ['male', np.nan, 'female', 'female', 'male', 'female', np.nan, 'female', 'male']}
)
df

    Age  Gender
0  15.0    male
1   NaN     NaN
2  18.0  female
3  19.4  female
4  20.0    male
5  15.0  female
6  15.0     NaN
7  15.0  female
8  20.0    male

In [3]:
df[df['Gender'].isnull()]

    Age Gender
1   NaN    NaN
6  15.0    NaN

In [8]:
len(df)

9

In [5]:
len(df.columns)

2

In [10]:
df.columns

Index(['Age', 'Gender'], dtype='object')

In [11]:
df.drop(columns=['Gender'])

    Age
0  15.0
1   NaN
2  18.0
3  19.4
4  20.0
5  15.0
6  15.0
7  15.0
8  20.0